In [83]:
import pandas as pd
import numpy as np

pd.__version__
pd.show_versions()

drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.11.1.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19044
machine          : AMD64
processor        : AMD64 Family 25 Model 80 Stepping 0, AuthenticAMD
byteorder        : little
LC_ALL           : en_US.UTF-8
LANG             : en_US.UTF-8
LOCALE           : English_United States.1252

pandas           : 1.5.3
numpy            : 1.24.2
pytz             : 2022.7.1
dateutil         : 2.8.2
setuptools       : 67.3.3
pip              : 23.0.1
Cython           : None
pytest           : 7.2.1
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.10.0
pandas_datareader: None
bs4              : 4.11.2
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.0
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : 2022.7

C:\Users\kgury\AppData\Local\Temp\ipykernel_28504\3911441206.py:10: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')

In [23]:
df = pd.DataFrame({'item':['blue', 'red', 'green', 'yellow'], 'price' : [10, 20, 30, 40]})
df

     item  price
0    blue     10
1     red     20
2   green     30
3  yellow     40

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   item    4 non-null      object
 1   price   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [25]:
pd.DataFrame(np.random.randn(10, 2), columns=['price', 'volume'])

      price    volume
0  0.456045 -0.301041
1 -0.612332 -0.280618
2 -0.367075 -0.013200
3  0.214810 -0.507926
4  0.468246 -0.447473
5 -1.166460  1.433126
6 -2.722698  0.805357
7 -0.932102 -0.314497
8  0.214232  0.751457
9 -0.535892 -0.623890

In [26]:
df.rename({'price': 'price values'}, axis='columns')

     item  price values
0    blue            10
1     red            20
2   green            30
3  yellow            40

In [63]:
df.columns = ['col one', 'col two']

In [64]:
df

  col one  col two
0    blue       10
1     red       20
2   green       30
3  yellow       40

In [66]:
df.columns = df.columns.str.replace(' ', '')
df

   colone  coltwo
0    blue      10
1     red      20
2   green      30
3  yellow      40

In [67]:
df.add_suffix('__x__')

  colone__x__  coltwo__x__
0        blue           10
1         red           20
2       green           30
3      yellow           40

In [69]:
df.columns = ['item', 'price']
df

     item  price
0    blue     10
1     red     20
2   green     30
3  yellow     40

In [70]:
df.add_suffix('__x__')

  item__x__  price__x__
0      blue          10
1       red          20
2     green          30
3    yellow          40

In [74]:
# Reverse

In [77]:
import requests
all_countries = requests.get('https://restcountries.com/v3.1/all').json()
countries_list = [{'name': country['name']['common'], 'continent': country['region']} for country in all_countries]
countries = pd.DataFrame(countries_list).sort_values('name').reset_index(drop=True)
countries.head()

             name continent
0     Afghanistan      Asia
1         Albania    Europe
2         Algeria    Africa
3  American Samoa   Oceania
4         Andorra    Europe

In [78]:
countries.loc[::-1]

               name continent
249   Åland Islands    Europe
248        Zimbabwe    Africa
247          Zambia    Africa
246           Yemen      Asia
245  Western Sahara    Africa
..              ...       ...
4           Andorra    Europe
3    American Samoa   Oceania
2           Algeria    Africa
1           Albania    Europe
0       Afghanistan      Asia

[250 rows x 2 columns]

In [80]:
countries.loc[::-1].reset_index(drop=True).head()

             name continent
0   Åland Islands    Europe
1        Zimbabwe    Africa
2          Zambia    Africa
3           Yemen      Asia
4  Western Sahara    Africa

In [81]:
countries.loc[:, ::-1].head()

  continent            name
0      Asia     Afghanistan
1    Europe         Albania
2    Africa         Algeria
3   Oceania  American Samoa
4    Europe         Andorra

In [82]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [87]:
drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

In [88]:
drinks.loc[:, ::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

In [89]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [90]:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [91]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [92]:
drinks.select_dtypes(include=['object', 'number', 'category', 'datetime']).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [94]:
drinks.select_dtypes(exclude='float', include='number')

     beer_servings  spirit_servings  wine_servings
0                0                0              0
1               89              132             54
2               25                0             14
3              245              138            312
4              217               57             45
..             ...              ...            ...
188            333              100              3
189            111                2              1
190              6                0              0
191             32               19              4
192             64               18              4

[193 rows x 3 columns]

In [95]:
df = pd.DataFrame({'col_01': ['1.0', '2.0', '3.3'],
                   'col_02': ['4.3', '5.4', '6.5'],
                   'col_03': ['7.6', '8.7', '-']})
df

  col_01 col_02 col_03
0    1.0    4.3    7.6
1    2.0    5.4    8.7
2    3.3    6.5      -

In [96]:
df.dtypes

col_01    object
col_02    object
col_03    object
dtype: object

In [97]:
df.astype({'col_01': 'float', 'col_02':float})

   col_01  col_02 col_03
0     1.0     4.3    7.6
1     2.0     5.4    8.7
2     3.3     6.5      -

In [98]:
df.dtypes

col_01    object
col_02    object
col_03    object
dtype: object

In [99]:
df.astype({'col_01': 'float', 'col_02':float}).dtypes

col_01    float64
col_02    float64
col_03     object
dtype: object

In [101]:
pd.to_numeric(df.col_03, errors='coerce')

0    7.6
1    8.7
2    NaN
Name: col_03, dtype: float64

In [102]:
pd.to_numeric(df.col_03, errors='coerce').fillna(0)

0    7.6
1    8.7
2    0.0
Name: col_03, dtype: float64

In [103]:
df
df.dtypes

col_01    object
col_02    object
col_03    object
dtype: object

In [105]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)

In [106]:
df.dtypes

col_01    float64
col_02    float64
col_03    float64
dtype: object

In [107]:
df

   col_01  col_02  col_03
0     1.0     4.3     7.6
1     2.0     5.4     8.7
2     3.3     6.5     0.0

In [115]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [117]:
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=['beer_servings', 'continent'])
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

In [122]:
dtypes = {'continent':'category'}
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=['beer_servings', 'continent'], dtype=dtypes)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

In [123]:
pd.read_csv('data/stocks1.csv')

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT

In [133]:
from glob import glob, iglob

print(*iglob('data/stocks?.csv'))

data\stocks1.csv data\stocks2.csv data\stocks3.csv

In [136]:
pd.concat((pd.read_csv(file) for file in iglob('data/stocks?.csv')), ignore_index=True)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [140]:
pd.concat((pd.read_csv(file) for file in iglob('data/drinks?.csv')), axis='columns')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [144]:
# clipboard
df = pd.read_clipboard(sep=',')
df

         country  beer_servings  spirit_servings
0    Afghanistan              0                0
1        Albania             89              132
2        Algeria             25                0
3        Andorra            245              138
4         Angola            217               57
..           ...            ...              ...
188    Venezuela            333              100
189      Vietnam            111                2
190        Yemen              6                0
191       Zambia             32               19
192     Zimbabwe             64               18

[193 rows x 3 columns]

In [145]:
df.dtypes

country            object
beer_servings       int64
spirit_servings     int64
dtype: object

In [146]:
len(movies)

979

In [147]:
movies1 = movies.sample(frac=0.75)
movies2 = movies.drop(movies1.index)

In [148]:
len(movies1) + len(movies2) - len(movies)

0

In [150]:
movies1.index.sort_values()

Int64Index([  0,   1,   3,   5,   6,   7,   8,   9,  10,  12,
            ...
            967, 969, 970, 971, 972, 973, 975, 976, 977, 978],
           dtype='int64', length=734)

In [151]:
movies2.index.sort_values()

Int64Index([  2,   4,  11,  18,  23,  28,  44,  45,  47,  55,
            ...
            925, 933, 936, 937, 943, 951, 952, 965, 968, 974],
           dtype='int64', length=245)

In [152]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [155]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [157]:
movies[movies.genre.isin(['Drama','Action'])]

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
...,...,...,...,...,...,...
968,7.4,The English Patient,R,Drama,162,"[u'Ralph Fiennes', u'Juliette Binoche', u'Will..."
970,7.4,Wonder Boys,R,Drama,107,"[u'Michael Douglas', u'Tobey Maguire', u'Franc..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."

In [158]:
len(movies)

979

In [159]:
movies[(movies.genre == 'Action') | (movies.genre == 'Drama')]

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
...,...,...,...,...,...,...
968,7.4,The English Patient,R,Drama,162,"[u'Ralph Fiennes', u'Juliette Binoche', u'Will..."
970,7.4,Wonder Boys,R,Drama,107,"[u'Michael Douglas', u'Tobey Maguire', u'Franc..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."

In [171]:
movies[(movies.genre != 'Action') & (movies.genre != 'Drama')]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
...,...,...,...,...,...,...
971,7.4,Death at a Funeral,R,Comedy,90,"[u'Matthew Macfadyen', u'Peter Dinklage', u'Ew..."
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [180]:
len(movies) - (len(movies[(movies.genre == 'Action') | (movies.genre == 'Drama')]) + len(movies[(movies.genre != 'Action') & (movies.genre != 'Drama')]))

0

In [185]:
counts = movies.genre.value_counts()
counts.info

<bound method Series.info of Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: genre, dtype: int64>

In [186]:
counts.nlargest(3)

Drama     278
Comedy    156
Action    136
Name: genre, dtype: int64

In [190]:
movies[movies.genre.isin(counts.nlargest(3).index)]

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
...,...,...,...,...,...,...
971,7.4,Death at a Funeral,R,Comedy,90,"[u'Matthew Macfadyen', u'Peter Dinklage', u'Ew..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."